<template>
  <div id="app">
    <inference-engine></inference-engine>
  </div>
</template>

<script>
import InferenceEngine from "./InferenceEngine.vue";

/**
 * Основний компонент для експертної системи діагностики технічних проблем.
 * Використовує `InferenceEngine` для виконання логічного виводу на основі заданих фактів та правил.
 *
 * @component
 */
export default {
  components: {
    InferenceEngine,
  },
};
</script>

<docs lang="md">
Компонент `App` слугує як контейнер для експертної системи, призначеної для діагностики технічних проблем, таких як несправності у комп'ютерах або автомобілях. Він інтегрує `InferenceEngine`, який обробляє логічні операції на основі введених користувачем даних та виводить можливі причини проблем.

## Опис

`App` використовує `InferenceEngine` для аналізу симптомів і виведення відповідних діагностичних результатів. Компонент забезпечує візуальний інтерфейс для введення даних та відображення висновків системи.

## Приклади використання

### Діагностика комп'ютера

Використання системи для визначення причин несправностей комп'ютера на основі таких симптомів, як несподіване перезавантаження чи відмова включення.

```html
<app>
  <inference-engine initial-facts="['pc_reboots', 'pc_does_not_turn_on']" />
</app>
```
</docs>
